extends RefCounted

const GOOD: Array = [
	{"role": "Рассказчик", "text": "Прошло несколько дней."},
	{"role": "Рассказчик", "text": "Кофейня уже не была только для людей - она стала местом, где вампиры и люди могли существовать вместе."},
	{"role": "Рассказчик", "text": "В один из вечеров снова пришло сообщение от алхимика."},
	{"role": "Алхимик", "text": "Я следил за твоими результатами. Достойно."},
	{"role": "Алхимик", "text": "Если согласна, продолжим вместе. Нам нужно больше зерен и твои навыки баристы."},
	{"role": "Героиня", "text": "Согласна."},
	{"role": "Героиня", "text": "Если это правда помогает вампирам, я сделаю все, что возможно."},
	{"role": "Рассказчик", "text": "Так началась их совместная работа."},
	{"role": "Рассказчик", "text": "Алхимика и баристы."}
]

const BAD: Array = [
		{"role": "Рассказчик", "text": "В кофейне становится тихо."},
		{"role": "Рассказчик", "text": "Окончательно тихо."}
]
